src/ChartsOfCharacteristicTypes/__ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>__ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.__ПредопределенныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.__ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/CommonModules/__ПредопределенныеЗначения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьПредопределенныеЗначения() Экспорт
	
	ТЗПредопределенныхЗначений = __ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначения();
	
	ТЗПредопределенныхЗначенийКСозданию = ПредопределенныеЗначенияКСозданию(ТЗПредопределенныхЗначений);
	
	Пока ТЗПредопределенныхЗначенийКСозданию.Следующий() Цикл
		
		СоздатьПредопределенноеЗначение(ТЗПредопределенныхЗначенийКСозданию);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеПредопределенногоЗначения(Идентификатор) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	__ПредопределенныеЗначения.Значение КАК Значение,
		|	__ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	__ПредопределенныеЗначения.ЗначенияЭлементов.(
		|		Значение КАК Значение
		|	) КАК ЗначенияЭлементов
		|ИЗ
		|	ПланВидовХарактеристик.__ПредопределенныеЗначения КАК __ПредопределенныеЗначения
		|ГДЕ
		|	__ПредопределенныеЗначения.ИдентификаторНастройки = &ИдентификаторНастройки";
	
	Запрос.УстановитьПараметр("ИдентификаторНастройки", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СписокЗначений Тогда
			
			Результат = ВыборкаДетальныеЗаписи.ЗначенияЭлементов.Выгрузить().ВыгрузитьКолонку("Значение");
			
		Иначе
			
			Результат = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеЗначенияКСозданию(ТЗПредопределенныхЗначений)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Наименование КАК Наименование,
		|	ТЗ.ИдентификаторНастройки КАК ИдентификаторНастройки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Наименование КАК Наименование,
		|	ВТ.ИдентификаторНастройки КАК ИдентификаторНастройки
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.__ПредопределенныеЗначения КАК __ПредопределенныеЗначения
		|		ПО ВТ.ИдентификаторНастройки = __ПредопределенныеЗначения.ИдентификаторНастройки
		|ГДЕ
		|	__ПредопределенныеЗначения.Ссылка ЕСТЬ NULL"; 
	
	Запрос.УстановитьПараметр("ТЗ", ТЗПредопределенныхЗначений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции 

Процедура СоздатьПредопределенноеЗначение(Выборка)
	
	НовЗначение = ПланыВидовХарактеристик.__ПредопределенныеЗначения.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(НовЗначение, Выборка);
	
	Попытка;
		НовЗначение.Записать();
	Исключение;
		__БазоваяФункциональностьБИТ.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
